using System;

namespace HomeWork_2_4
{
    class Program
    {

        static int TopX(int leg)
        {
            int centerX;
            return centerX = (Console.WindowWidth / 2) - (leg / 2);

        }
        static int TopY(int sch)
        {
            int centerY;
            return centerY = (Console.WindowHeight / 2) - sch;

        }

        //static void PrintLine()
        //{

        //    Console.WriteLine("----------------------------------------");

        //}
        static int LineNumber = 0;
        static int PrinText(string line)
        {

            int strLengh = line.Length;
            Console.SetCursorPosition(TopX(strLengh), LineNumber);
            Console.WriteLine(line);
            return ++LineNumber;

        }

        static void Main(string[] args)
        {
            Console.ForegroundColor = ConsoleColor.Magenta;

            DateTime data = DateTime.Now;
            string dates = data.ToString("dd.MM.yyyy    HH:mm");

            string[] text = {
                "ЛЕНТА",
                "Адресс где закупался",
                "ДОКУМЕНТ НА ПРОДАЖУ N 324 N: 0059",
                "---------------------------------------------------",
                "Кассовый чек (ПРИХОД)     *ПРОДАЖА ТОВАРА",
                "---------------------------------------------------",
                "Картофель белый мытый 54.99 * 1.738  =95.57 НДС 10%",
                "Скидка на товар составила            =5.04",
                "Мандарины вес 1КГ     72.79 * 1.374 =100.01 НДС 10%",
                "Скидка на товар составила            =44.66",
                "Майонез СЛОБОДА Прова 87.89 * 1      =95.57 НДС 10%",
                "Скидка на товар составила            =4.70",
                "Пельмени CAESAR Stand 147.54 * 1    =147.54 НДС 10%",
                "Скидка на товар составила           =147.25",
                "Макароны MAKFA Витки  56.99 * 1      =56.99 НДС 10%",
                "Скидка на товар составила            =3.00",
                "---------------------------------------------------",
                "БАНКОВСКИЕ ОПЛАТЫ",
                "---------------------------------------------------",
                dates+"                      ЧЕК 0260",
                "ПАО СБЕРАБАНК                                Оплата",
                "Сумма (руб):                                 488.00",
                "Комиссия за операцию - 0 Руб.                      ",
                "ОДОБРЕНО",
                "Код авторизации:                             206813",
                "Номер ссылки:                          101791061080",
                "Подпись клиента не требуется",
                "---------------------------------------------------",
                "---------------------------------------------------",
                "",
                "",
                "---------------------------------------------------",
                "                     ИТОГО К ОПЛАТЕ         =488.00",
                "                      БЕЗНАЛИЧНЫМИ          =488.00",
                "---------------------------------------------------",
                "СПАСИБО ЗА ПОКУПКУ!"
            };

            foreach (string i in text)
            {
                PrinText(i);
            }
            Console.ReadLine();

        }
    }
}
